// ! Масиви
// Створіть масив styles з елементами «Джаз» та «Блюз».
// Додайте "Рок-н-рол" в кінець.
// Замініть значення "Блюз" на "Класика".
// Видалить перший елемент масиву і виведіть його в консоль.
// Вставте «Реп» і «Реггі» на початок масиву.

//TODO:=========task-1=================
//Перетворити рядок, що містить слова, розділені комами, в масив слів і вивести кожне слово в окремому рядку.

// const str = 'JavaScript, HTML, CSS, React';

//TODO:=========task-2=================
// Знайти кількість слів у рядку, використовуючи методи масивів та цикл for...of.

// const message = 'JavaScript is a popular programming language.';

//TODO:=========task-3=================
// Об'єднати масив слів в рядок, розділений комами та пробілами.

// const words = ['JavaScript', 'HTML', 'CSS', 'React'];

//TODO:=========task-4=================
// Знайти всі елементи масиву, що містять задану підстроку, та об'єднати їх у новий масив, після чого вивести у консоль лог повідомлення "Масив елементів, що містять підстроку substring: ..." .Результат повинен бути розділений комами та пробілами.(використати indexOf)

// const arr = ['JavaScript', 'HTML', 'CSS', 'React'];

// const substring = 'S';
// const filteredArr = [];

// console.log(
//   `Масив елементів, що містять підстроку ${substring} : ${joinedArray}`
// );

//TODO:=========task-5=================
// Перевірити, чи містить масив заданий елемент. Якщо містить, видалити його, якщо ні - додати в кінець масиву.

// const arr = ['JavaScript', 'HTML', 'CSS'];
// const elem = 'SS';

//TODO:=========task-6=================
//Напиши функцію findSmallerNumber(numbers)
//яка шукає найменше число в масиві.
//Додай перевірку що функція отримує масив

// const numbers = [2, 5, 35, 56, 12, 24, 7, 80, 3];
